from mechanical_part import search
from interval import set_search_interval

"""
Создайте модуль для получения простых чисел. Импортируйте его из другого модуля. Импортируйте
отдельные его имена.
"""

print(f'\n\tIn the main module we usage all blocks\n', '-'*50)
print(search(set_search_interval()))

