"""
Напишите итератор, который возвращает элементы заданного списка в обратном порядке (аналог
reversed).
"""

my_numbers = [23, 2, 112, 8, 548, 237]
for item in my_numbers[::-1]:
    print(item)
